Revit 2026 API

# LogicalAndFilter Methods

---

The LogicalAndFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ElementFilter) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFilters | Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter. (Inherited from ElementLogicalFilter) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PassesFilter(Element) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | SetFilters | (Inherited from ElementLogicalFilter) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

LogicalAndFilter Class

Autodesk.Revit.DB Namespace